app/controllers/ArticlesController.rb

    def index
        render json: Article.all, status: :ok
---
SELECT "articles".* FROM "articles"